ИС_СПОРТ_2022/src/Documents/СтраховойПолисСпортсмена/СтраховойПолисСпортсмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СтраховойПолисСпортсмена</name>
  <registerRecords>InformationRegister.РегистрацияСтраховыхПолисовСпортсменов</registerRecords>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраховаяКомпания</name>
    <type>
      <types>CatalogRef.СтраховыеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраховаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховаяПремия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключеныЗанятияСпортом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиПолиса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтраховогоПолиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияСтраховогоПолиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/СтраховойПолисСпортсмена/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	""РегистрацияСтраховыхПолисовСпортсменов"" КАК ИмяРегистра_,
	                |	СтраховойПолисСпортсмена.Дата КАК Период,
	                |	СтраховойПолисСпортсмена.Спортсмен КАК Спортсмен,
	                |	СтраховойПолисСпортсмена.СтраховаяКомпания КАК СтраховаяКомпания,
	                |	СтраховойПолисСпортсмена.СтраховаяСумма КАК СтраховаяСумма,
	                |	СтраховойПолисСпортсмена.СтраховаяПремия КАК СтраховаяПремия,
	                |	СтраховойПолисСпортсмена.ДатаНачала КАК ДатаНачала,
	                |	СтраховойПолисСпортсмена.ДатаОкончания КАК ДатаОкончания,
	                |	СтраховойПолисСпортсмена.ВидСпорта КАК ВидСпорта,
	                |	СтраховойПолисСпортсмена.Организация КАК Организация,
	                |	СтраховойПолисСпортсмена.ДатаВыдачиПолиса КАК ДатаВыдачиПолиса,
	                |	СтраховойПолисСпортсмена.НомерСтраховогоПолиса КАК НомерСтраховогоПолиса,
					|	СтраховойПолисСпортсмена.СерияСтраховогоПолиса КАК СерияСтраховогоПолиса
	                |ИЗ
	                |	Документ.СтраховойПолисСпортсмена КАК СтраховойПолисСпортсмена
	                |ГДЕ
	                |	СтраховойПолисСпортсмена.Ссылка = &Ссылка";
	
	ТаблицаРегистрацияСтраховыхПолисовСпортсменов = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРегистрацияСтраховыхПолисовСпортсменов"           , ТаблицаРегистрацияСтраховыхПолисовСпортсменов);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.СтраховойПолисСпортсмена.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.СтраховойПолисСпортсмена.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.СтраховойПолисСпортсмена.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры
